fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>ВКМ_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
				
	ОчищаемОснование = ПроверяемыеРеквизиты.Найти("Основание");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора.Ссылка КАК ВидДоговораСсылка,
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &Перечисления
		|	И РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Перечисления", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание); 
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Договор = Договор Тогда 
		Если ОчищаемОснование <> неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ОчищаемОснование);
			Отказ = Ложь;
		КонецЕсли;
	КонецЕсли;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьАвтозаполнение()экспорт
	
	 ПроверкаДублейРеализаций = ПроверитьРеализацииСТакимДоговором();
		
		Если ЗначениеЗаполнено (ПроверкаДублейРеализаций) Тогда 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ("По этому договору  " +  ЭтотОбъект.Договор.Ссылка +  "  уже были сформированы данные на основании документа обслуживание клиентов!" );
			Сообщение.Сообщить();	
			Возврат; 
			Отказ = истина;
		КонецЕсли;
	
		
		НАбонентскаяПлата =  Константы.ВКМ_НоменклатураАбонентскойПлаты.Получить();
		НРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		
		Если Не ЗначениеЗаполнено (НАбонентскаяПлата.Наименование) или Не ЗначениеЗаполнено(НРаботыСпециалиста.Наименование) Тогда 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выберите правильный договор, Абонентское обслуживание.";
			Сообщение.Сообщить();
			
			Отказ = Истина;
		Иначе 
			ЭтотОбъект.Товары.Очистить();
			ЭтотОбъект.Услуги.Очистить(); 
			Если   ЗначениеЗаполнено (ЭтотОбъект.Договор.ВКМ_СуммаАбонентскойПлаты) Тогда
				НоваяСтрокаТовары = ЭтотОбъект.Товары.Добавить();
				НоваяСтрокаТовары.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НАбонентскаяПлата);
				НоваяСтрокаТовары.Количество = "1";
				НоваяСтрокаТовары.Цена = ЭтотОбъект.Договор.ВКМ_СуммаАбонентскойПлаты;
				НоваяСтрокаТовары.Сумма = ЭтотОбъект.Договор.ВКМ_СуммаАбонентскойПлаты; 
			КонецЕсли;
			
			Таблица =  ПолучитьДанныеПоСтоимостиИКоличеству();
			КолЧасов = Таблица.Колонки.Найти("КолЧасов");
			СуммаКОплате = Таблица.Колонки.Найти("СуммаКОплате");;
			Если ЗначениеЗаполнено(Таблица) и КолЧасов <> 0 и СуммаКОплате <> 0 Тогда
				НоваяСтрока = ЭтотОбъект.услуги.Добавить();
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НРаботыСпециалиста);
				Для Каждого СтрТаблица из Таблица цикл 
					НоваяСтрока.Количество = СтрТаблица.КолЧасов;
					НоваяСтрока.Сумма = СтрТаблица.СуммаКоплате;
					НоваяСтрока.Цена =  Окр(НоваяСтрока.Сумма/НоваяСтрока.Количество,2);
					
				КонецЦикла;
				
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
				
			ИначеЕсли Не ЗначениеЗаполнено(Таблица) Тогда			
				ЭтотОбъект.Товары.Очистить(); 
				ЭтотОбъект.СуммаДокумента = 0;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "По этому договору уже были сформированы данные на основании документа обслуживание клиентов";
				Сообщение.Сообщить();						
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеПоСтоимостиИКоличеству()экспорт 
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(ВКМ_ВыполненныеКлиентуРаботы.Период, МЕСЯЦ) КАК Период,
		|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, МЕСЯЦ) КАК ДатаДокРеализация,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.ВКМ_КоличествоЧасов, 0)) КАК КолЧасов,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.ВКМ_СуммаКОплате, 0)) КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВКМ_ВыполненныеКлиентуРаботы.ВКМ_Договор.Ссылка = РеализацияТоваровУслуг.Договор.Ссылка
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВКМ_ВыполненныеКлиентуРаботы.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, МЕСЯЦ)
		|	И РеализацияТоваровУслуг.Договор.Ссылка = &СсылкаДоговор
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Ссылка,
		|	НАЧАЛОПЕРИОДА(ВКМ_ВыполненныеКлиентуРаботы.Период, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, МЕСЯЦ)";
		
		
		Запрос.УстановитьПараметр("СсылкаДоговор", ЭтотОбъект.Договор.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ТЗ = РезультатЗапроса.Выгрузить();		
		Возврат ТЗ;	
		
КонецФункции
	
Функция ПроверитьРеализацииСТакимДоговором() экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбработкаЗаказов.Регистратор.Ссылка КАК ОбработкаЗаказов,
		|	ОбработкаЗаказов.Договор.Ссылка КАК ДоговорОбработкаЗаказов,
		|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Ссылка КАК Реализация,
		|	ВКМ_ВыполненныеКлиентуРаботы.ВКМ_Договор.Ссылка КАК ДоговорРеализация
		|ИЗ
		|	РегистрНакопления.ОбработкаЗаказов КАК ОбработкаЗаказов
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|		ПО ОбработкаЗаказов.Договор.Ссылка = ВКМ_ВыполненныеКлиентуРаботы.ВКМ_Договор.Ссылка,
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	ОбработкаЗаказов.Договор.Ссылка = РеализацияТоваровУслуг.Договор.Ссылка
		|	И РеализацияТоваровУслуг.Договор.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботы.ВКМ_Договор.Ссылка,
		|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Ссылка,
		|	ОбработкаЗаказов.Договор.Ссылка,
		|	ОбработкаЗаказов.Регистратор.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Договор.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();  
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаДанных;	
	
КонецФункции
	


#КонецОбласти

#КонецЕсли
